src/cf/src/InformationRegisters/ПравилаЦенообразования/ПравилаЦенообразования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПравилаЦенообразования</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОсноваРасчёта</name>
    <type>
      <types>EnumRef.ОсновыРасчётаНаценок</types>
    </type>
  </resources>
  <resources>
    <name>ВидНаценки</name>
    <type>
      <types>EnumRef.ВидыНаценок</types>
    </type>
  </resources>
  <resources>
    <name>Показатель</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Параметр</name>
    <type>
      <types>DefinedType.ПараметрЦенообразования</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/НастройкиПользователей/НастройкиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПользователей</name>
  <resources>
    <name>Значение</name>
    <comment>(Общ)</comment>
    <type>
      <types>Characteristic.ВидыНастроекПользователей</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Настройка</name>
    <comment>(Общ)</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыНастроекПользователей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/МинимальныйОстатокПоСкладам/МинимальныйОстатокПоСкладам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МинимальныйОстатокПоСкладам</name>
  <resources>
    <name>МинимальноеКоличествоХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МаксимальноеКоличествоХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/СистемныеОповещения/СистемныеОповещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СистемныеОповещения</name>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Новое</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Отображено</name>
    <comment>Было или небыло выведено оповещение пользователю</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НавигационнаяСсылка</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ХозяйственныеОперации</name>
  <enumValues>
    <name>АвансКлиента</name>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОплатыКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствВКассу</name>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>ЗакупкаУПоставщика</name>
  </enumValues>
  <enumValues>
    <name>КомплектацияНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеОприходование</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеСписание</name>
  </enumValues>
  <enumValues>
    <name>ПеречислениеДенежныхСредствНаБанковскийСчет</name>
  </enumValues>
  <enumValues>
    <name>ПеречислениеНалоговИВзносов</name>
  </enumValues>
  <enumValues>
    <name>ПланируемыеЦеныЗакупки</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзКассы</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствСБанковскогоСчета</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеОплатыОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ПродажаВКредит</name>
  </enumValues>
  <enumValues>
    <name>ПрочееПоступлениеДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>ПрочийРасходДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>РазукомплектацияНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>РеализацияКлиенту</name>
  </enumValues>
  <enumValues>
    <name>Сертификат</name>
  </enumValues>
  <enumValues>
    <name>СнятиеНаличныхДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>СписаниеЗадолженности</name>
  </enumValues>
  <enumValues>
    <name>УстановкаЦенНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ОбналичиваниеЧека</name>
  </enumValues>
  <enumValues>
    <name>ОперационныеЗатраты</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>Инкассация</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Documents/УстановкаЦенНоменклатуры/УстановкаЦенНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаЦенНоменклатуры</name>
  <basedOn>Document.ПоступлениеТоваровУслуг</basedOn>
  <registerRecords>InformationRegister.ЦеныНоменклатуры</registerRecords>
  <attributes>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>CatalogRef.ТоварныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧЦены</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЗакупочная</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаРозничная</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Documents/КассоваяСмена/КассоваяСмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КассоваяСмена</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОткрытия</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗакрытия</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКассовойСмены</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
</mdclass:Document>

src/cf/src/Catalogs/ВидыЦен/ВидыЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыЦен</name>
  <predefined>
    <items>
      <name>Закупочная</name>
      <description>Prix d'achat</description>
    </items>
    <items>
      <name>Розничная</name>
      <description>Prix de vente</description>
    </items>
    <items>
      <name>МинимальнаяЦенаПродажи</name>
      <description>Prix minimal</description>
    </items>
  </predefined>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДинамическийРасчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсноваРасчёта</name>
    <type>
      <types>EnumRef.ОсновыРасчётаНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНаценки</name>
    <type>
      <types>EnumRef.ВидыНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Точность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <comment>Уникальный идентификатор пользователя информационной базы</comment>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходВПрограммуРазрешен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Роли</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОтображатьОповещения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Внешний</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/CommonModules/ПроцедурыРегламентныхЗаданий/Module.bsl
#Область Внутренние 
 
Процедура ПерепроведениеДокументов(Знач ТЗДокументы = Неопределено) Экспорт
	Если ТЗДокументы = Неопределено Тогда
		ТЗДокументы = РаботаСДокументами.ПолучитьПоследовательность();	
	КонецЕсли;
	Док = Неопределено;
	ПервыйДокументСОшибкой = Неопределено;
	ВсегоДокументов = ТЗДокументы.Количество();
	ПроведеноДокументов = 0;
	РегистрыСведений.НепроведенныеДокументы.ОчиститьОшибки();
	Для Каждого Стр Из ТЗДокументы Цикл
		Док = Стр.Документ.ПолучитьОбъект();
		Док.ДополнительныеСвойства.Вставить(РаботаСДокументами.СвойствоВыполняетсяФоновоеПерепроведение(), Истина);
		Попытка
			Док.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Если ПервыйДокументСОшибкой = Неопределено Тогда
				ПервыйДокументСОшибкой = Док;	
			КонецЕсли;	
		КонецПопытки;
		Если Док.ДополнительныеСвойства.Свойство("ТекстОшибки") Тогда
			РегистрыСведений.НепроведенныеДокументы.ЗаписатьОшибку(Док.Ссылка, Док.ДополнительныеСвойства.ТекстОшибки);
		КонецЕсли;
		ПроведеноДокументов = ПроведеноДокументов + 1;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = Строка(ВсегоДокументов) + ";" + Строка(ПроведеноДокументов) + ";" + Строка(Док.Дата);			
		Сообщение.Сообщить();		
	КонецЦикла;
	Если ПервыйДокументСОшибкой <> Неопределено Тогда
		Последовательности.Основная.УстановитьГраницу(ПервыйДокументСОшибкой.МоментВремени());		
	ИначеЕсли Док <> Неопределено Тогда
		Последовательности.Основная.УстановитьГраницу(Док.МоментВремени());		
	КонецЕсли;
КонецПроцедуры

Процедура ОбновлениеРозничныхЦен() Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПравилаЦенообразованияСрезПоследних.Параметр КАК ТоварнаяГруппа
	                      |ИЗ
	                      |	РегистрСведений.ПравилаЦенообразования.СрезПоследних(&ДатаСреза, ) КАК ПравилаЦенообразованияСрезПоследних
	                      |ГДЕ
	                      |	ПравилаЦенообразованияСрезПоследних.Параметр ССЫЛКА Справочник.ТоварныеГруппы");
	Запрос.УстановитьПараметр("ДатаСреза", ТекущаяДатаСеанса());
	Выб = Запрос.Выполнить().Выбрать();
	Пока Выб.Следующий() Цикл
		Док = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
		Док.Дата = ТекущаяДатаСеанса();
		Док.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.УстановкаЦенНоменклатуры;
		Док.ВидЦены = Справочники.ВидыЦен.Розничная;
        Док.ТоварнаяГруппа = Выб.ТоварнаяГруппа;	
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ВЫРАЗИТЬ(ТЗБазовыеЦены.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
		                      |	ВЫРАЗИТЬ(ТЗБазовыеЦены.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
		                      |	ВЫРАЗИТЬ(ТЗБазовыеЦены.Цена КАК ЧИСЛО) КАК Цена
		                      |ПОМЕСТИТЬ ВТБазовыеЦены
		                      |ИЗ
		                      |	&ТЗБазовыеЦены КАК ТЗБазовыеЦены
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ВТБазовыеЦены.Номенклатура КАК Номенклатура,
		                      |	ВТБазовыеЦены.Характеристика КАК Характеристика,
		                      |	ВТБазовыеЦены.Цена КАК Цена
		                      |ИЗ
		                      |	ВТБазовыеЦены КАК ВТБазовыеЦены
		                      |ГДЕ
		                      |	ВТБазовыеЦены.Номенклатура.ТоварнаяГруппа = &ТоварнаяГруппа");
		ЦенаВключаетНДС = ОбщегоНазначенияВызовСервера.ЦенаВключаетНДСПоВидуЦен(Док.ВидЦены);
		ТЗБазовыеЦены = РегистрыСведений.ПравилаЦенообразования.СформироватьБазовыеЦены(Док.Дата, ЦенаВключаетНДС);
		Запрос.УстановитьПараметр("ТЗБазовыеЦены", ТЗБазовыеЦены);
		Запрос.УстановитьПараметр("ТоварнаяГруппа", Выб.ТоварнаяГруппа);
		Док.ТЧЦены.Загрузить(Запрос.Выполнить().Выгрузить());
		Док.Комментарий = "Сформирован автоматически по данным правил ценообразования";
		Если Док.ТЧЦены.Количество() = 0 Тогда Продолжить КонецЕсли;
		Док.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;	
КонецПроцедуры

Процедура ПроверкаМинимальногоОстатка(МассивТоваров = Неопределено, Склад = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиПользователей.Пользователь КАК Пользователь
	|ИЗ
	|	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
	|ГДЕ
	|	НастройкиПользователей.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыНастроекПользователей.ОповещатьОМинимальномОстатке)
	|	И НастройкиПользователей.Значение = ИСТИНА";
	
	Мас = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пользователь");
	Если Мас.Количество() = 0 Тогда 
		возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыВНаличииОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыВНаличииОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	ТоварыВНаличииОстатки.МестоХранения КАК МестоХранения
	|ИЗ
	|	РегистрНакопления.ТоварыВНаличии.Остатки(
	|			,
	|			ВЫБОР
	|					КОГДА &ЕстьТовары
	|						ТОГДА Номенклатура В (&МассивТоваров)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И (МестоХранения = &Склад
	|					ИЛИ &Склад = НЕОПРЕДЕЛЕНО)
	|				И МестоХранения.ОповещатьОМинимальномОстатке) КАК ТоварыВНаличииОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МинимальныйОстатокПоСкладам КАК МинимальныйОстатокПоСкладам
	|		ПО ТоварыВНаличииОстатки.МестоХранения = МинимальныйОстатокПоСкладам.МестоХранения
	|			И ТоварыВНаличииОстатки.Номенклатура = МинимальныйОстатокПоСкладам.Номенклатура
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ЕСТЬNULL(МинимальныйОстатокПоСкладам.МинимальноеКоличествоХранения, 0) = 0
	|				ТОГДА ТоварыВНаличииОстатки.Номенклатура.МинимальноеКоличествоХранения
	|			ИНАЧЕ ЕСТЬNULL(МинимальныйОстатокПоСкладам.МинимальноеКоличествоХранения, 0)
	|		КОНЕЦ > ТоварыВНаличииОстатки.КоличествоОстаток";
	Запрос.УстановитьПараметр("ЕстьТовары", Не МассивТоваров = Неопределено);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("МассивТоваров", МассивТоваров);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекстОповещения = "" + Выборка.МестоХранения + ": ";
		ТекстОповещения = ТекстОповещения + НСтр("fr = 'Solde du produit inférieur au minimum:'; ru = 'Остаток по товару ниже минимального'; en = 'The product balance is below the minimum'; es = 'Saldo del producto por debajo del mínimo'") + Выборка.Номенклатура;
		Для Каждого Эл из Мас Цикл 
			РегистрыСведений.СистемныеОповещения.Сформировать(Эл,ТекстОповещения,ПолучитьНавигационнуюСсылку(Выборка.Номенклатура));
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

// Рассылает менеджерам системные оповещения о запрете отгрузок покупателям с включенным
// контролем кредита: «запрещено отгружать» при наступившем запрете или долге сверх кредита
// и «будет запрещено» за число дней из константы ОповещатьЗаКолДнейДоЗапретаОтгрузок.
Процедура ЗапретОтгрузок() Экспорт
	ДнейДоЗапрета = Константы.ОповещатьЗаКолДнейДоЗапретаОтгрузок.Получить();
	ТЗДолг = РегистрыНакопления.ВзаиморасчётыСПокупателями.ПолучитьПросроченнуюЗадолженность(, 0, Истина);
	Если ТЗДолг.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	ПользователиПоМенеджерам = ПользователиМенеджеров(ТЗДолг.ВыгрузитьКолонку("Менеджер"));
	ТекущийДень = НачалоДня(ТекущаяДатаСеанса());
	Для Каждого Стр Из ТЗДолг Цикл
		Если Не Стр.КонтрольКредита Тогда
			Продолжить;
		КонецЕсли;
		Пользователь = ПользователиПоМенеджерам.Получить(Стр.Менеджер);
		Если Пользователь = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ЗапретНаступил = Стр.ДолгСверхКредита > 0
			Или ЗначениеЗаполнено(Стр.ДатаЗапрета) И НачалоДня(Стр.ДатаЗапрета) <= ТекущийДень;
		Если ЗапретНаступил Тогда
			Шаблон = НСтр("fr = 'Il est interdit d''expédier au client %1 : dette %2, date d''interdiction %3';
				|ru = 'Клиенту %1 запрещено отгружать: долг %2, дата запрета %3';
				|en = 'Shipping to customer %1 is prohibited: debt %2, ban date %3';
				|es = 'Está prohibido enviar al cliente %1: deuda %2, fecha de prohibición %3'");
		ИначеЕсли ЗначениеЗаполнено(Стр.ДатаЗапрета) И ДнейДоЗапрета > 0
			И ВычисленияКлиентСервер.РазностьДатВДнях(Стр.ДатаЗапрета, ТекущийДень) <= ДнейДоЗапрета Тогда
			Шаблон = НСтр("fr = 'Les expéditions au client %1 seront interdites : dette %2, date d''interdiction %3';
				|ru = 'Клиенту %1 будет запрещено отгружать: долг %2, дата запрета %3';
				|en = 'Shipping to customer %1 will be prohibited: debt %2, ban date %3';
				|es = 'Los envíos al cliente %1 serán prohibidos: deuda %2, fecha de prohibición %3'");
		Иначе
			Продолжить;
		КонецЕсли;
		ТекстОповещения = СтрШаблон(Шаблон, Стр.Контрагент, Стр.Долг, Формат(Стр.ДатаЗапрета, "ДЛФ=Д"));
		РегистрыСведений.СистемныеОповещения.Сформировать(Пользователь, ТекстОповещения, ПолучитьНавигационнуюСсылку(Стр.Контрагент));
	КонецЦикла;
КонецПроцедуры

Функция ПользователиМенеджеров(МасМенеджеры)
	// Соответствие «физлицо-менеджер → пользователь» одним запросом.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Пользователи.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Пользователи.Ссылка КАК Пользователь
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.ФизическоеЛицо В (&МасМенеджеры)
	|	И НЕ Пользователи.ПометкаУдаления";
	Запрос.УстановитьПараметр("МасМенеджеры", МасМенеджеры);
	Результат = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.ФизическоеЛицо, Выборка.Пользователь);
	КонецЦикла;
	Возврат Результат;
КонецФункции

Процедура УстановитьДатуЗапретаРедактирования() Экспорт
	АвтозакрытиеПериода = Константы.АвтозакрытиеПериода.Получить();
	Если ЗначениеЗаполнено(АвтозакрытиеПериода) Тогда
		МЗ = РегистрыСведений.ДатыЗапретаРедактирования.СоздатьМенеджерЗаписи();
		МЗ.ВидЗапрета = ПланыВидовХарактеристик.ВидыЗапретаРедактирования.Общая;
		МЗ.ЗначениеЗапрета = "";
		МЗ.ДатаЗапрета = ТекущаяДата() - 86400*АвтозакрытиеПериода;
		МЗ.Записать(Истина);
	Иначе
		НЗ = РегистрыСведений.ДатыЗапретаРедактирования.СоздатьНаборЗаписей();
		НЗ.Отбор.ВидЗапрета.Установить(ПланыВидовХарактеристик.ВидыЗапретаРедактирования.Общая);
		НЗ.Отбор.ЗначениеЗапрета.Установить("");
		НЗ.Записать();
	КонецЕсли;
КонецПроцедуры

Процедура АвтозакрытиеСмены() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КассоваяСмена.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.КассоваяСмена КАК КассоваяСмена
	|ГДЕ
	|	КассоваяСмена.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
	|	И КассоваяСмена.Касса.АвтозакрытиеСмены
	|	И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ТекДата, ДЕНЬ), &ТекДата, СЕКУНДА) > РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(КассоваяСмена.Касса.ВремяЗакрытияСмены, ДЕНЬ), КассоваяСмена.Касса.ВремяЗакрытияСмены, СЕКУНДА)";
	Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		ДокКассоваяСмена = Выборка.Ссылка.ПолучитьОбъект();
		ДокКассоваяСмена.Статус = Перечисления.СтатусыКассовойСмены.Закрыта;
		ДокКассоваяСмена.СуммаЗакрытия = РаботаСДокументами.ПолучитьОстатокВКассе(ДокКассоваяСмена.Касса);
		ДокКассоваяСмена.Записать();
	КонецЦикла;
КонецПроцедуры

Процедура ЗакрытиеСеансов() Экспорт
	Если Найти(СтрокаСоединенияИнформационнойБазы(), "Srvr") > 0 Тогда
		
		Поиск1 = Найти(СтрокаСоединенияИнформационнойБазы(), "Srvr=");
		ПодстрокаПоиска = Сред(СтрокаСоединенияИнформационнойБазы(), Поиск1 + 6);
		ИмяСервера = Лев(ПодстрокаПоиска, Найти(ПодстрокаПоиска, """") - 1);
		
		Поиск1 = Найти(СтрокаСоединенияИнформационнойБазы(), "Ref=");
		ПодстрокаПоиска = Сред(СтрокаСоединенияИнформационнойБазы(), Поиск1 + 5);
		ИмяБазы = Лев(ПодстрокаПоиска, Найти(ПодстрокаПоиска, """") - 1);
	Иначе
		ИмяСервера = "";
		
	КонецЕсли;
	
	
	Попытка	
		
	Если ИмяСервера = "" тогда иначе
		
		Коннектор = Новый COMОбъект("v83.COMConnector");
		Агент = Коннектор.ConnectAgent(ИмяСервера);
		Кластеры = Агент.GetClusters();
		Для каждого Кластер из Кластеры Цикл
			АдминистраторКластера = Константы.АдминистраторКластера.Получить();
			ПарольКластера = Константы.ПарольКластера.Получить();
			Агент.Authenticate(Кластер, АдминистраторКластера, ПарольКластера);
			Процессы = Агент.GetWorkingProcesses(Кластер);
			Для каждого Процесс из Процессы Цикл
				Порт = Процесс.MainPort;
				
				РабПроц = Коннектор.ConnectWorkingProcess(ИмяСервера + ":" + СтрЗаменить(Порт, Символы.НПП, ""));
				РабПроц.AddAuthentication("Alexander Gordov", "1");
				
				ИнформационнаяБаза = "";
				
				Базы = Агент.GetInfoBases(Кластер);
				Для каждого База из Базы Цикл
					Если База.Name = ИмяБазы Тогда
						ИнформационнаяБаза = База;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если ИнформационнаяБаза = "" Тогда
					// база не найдена
				КонецЕсли;
				
				Сеансы = Агент.GetInfoBaseSessions(Кластер, ИнформационнаяБаза);
				Для каждого Сеанс из Сеансы Цикл
					Если нРег(Сеанс.AppID) = "backgroundjob" ИЛИ нРег(Сеанс.AppID) = "designer" Тогда
						Продолжить;
					КонецЕсли;
					Если Сеанс.UserName = ИмяПользователя() Тогда
						Продолжить;
					КонецЕсли;
					Агент.TerminateSession(Кластер, Сеанс);
				КонецЦикла;
				
				СоединенияБазы = Агент.GetInfoBaseConnections(Кластер, ИнформационнаяБаза);
				Для Каждого Соединение Из СоединенияБазы Цикл
					Если нРег(Соединение.Application) = "backgroundjob" ИЛИ нРег(Соединение.Application) = "designer" Тогда
						Продолжить;
					КонецЕсли;
					Если Соединение.UserName = ИмяПользователя() Тогда
						Продолжить;
					КонецЕсли;
					РабПроц.Disconnect(Соединение);
				КонецЦикла;  
				
			КонецЦикла;
		КонецЦикла;	
	КонецЕсли;
	
Исключение
КонецПопытки;
КонецПроцедуры

#КонецОбласти
